#pragma once
#pragma warning(disable: 4996)
#include <Windows.h>
#include <map>
#include <algorithm>
#include <sstream>
#include "logger.h"
#pragma region GameClasses
class CurrentSreen
{
public:
    char* name;
    __int32 strlen;
    __int8 unk1; // 
    __int8 unk2; // 
    __int8 unk3; // 
    __int8 unk4; // Always 0x80?
};

class Globals
{
public:
    class GlobalsChild* child; //0x0000
}; //Size: 0x0008

class GlobalsChild
{
public:
    void* fnUnk1; //0x0000
    void* fnUnk2; //0x0008
    void* fnUnk3; //0x0010
    void* fnUnk4; //0x0018
    void* fnUnk5; //0x0020
    void* fnUnk6; //0x0028
    void* fnGetPtr; //0x0030
    void* fnUnk7; //0x0038
    char pad_0040[248]; //0x0040
}; //Size: 0x0138

class LuaCMEngineFuncReg
{
public:
    char* fName; //0x0000
    int32_t nArgs; //0x0008
    int32_t Unk; //0x000C
    void* pCFunc; //0x0010
}; //Size: 0x0018


class ScriptFunctions
{
public:
    class ScriptFunctions0* pScriptFunctions0; //0x0000
    char pad_0008[8]; //0x0008
}; //Size: 0x0010

class ScriptFunctions0
{
public:
    char pad_0000[4408]; //0x0000
    class ScriptFunctionsCalendarr* pScriptFunctionsCalendar; //0x1138
    char pad_1140[152]; //0x1140
    class ScriptFunctionsUnk1* pScriptFunctionsUnk1; //0x11D8
}; //Size: 0x11E0

class ScriptFunctionsCalendarr
{
public:
    class ScriptFunctionsCalendar* pScriptFunctionsCalendar0; //0x0000
}; //Size: 0x0008

class ScriptFunctionsCalendar
{
public:
    class CalendarCurrentDates0* pScriptFunctionsCalendar1; //0x0000
    char pad_0008[8]; //0x0008
    int32_t ret_current_day; //0x0010
    int32_t ret_current_month; //0x0014
    int32_t ret_current_year; //0x0018
}; //Size: 0x001C
class CalendarCurrentDates0
{
public:
    char pad_0000[824]; //0x0000
    class CalendarCurrentDates1* pCalendarCurrentDates1; //0x0338
    char pad_0340[8]; //0x0340
}; //Size: 0x0348
class CalendarCurrentDates1
{
public:
    class CalendarCurrentDatesFinal* pCalendarCurrentDatesFinal; //0x0000
}; //Size: 0x0008

class CalendarCurrentDatesFinal
{
public:
    char pad_0000[52]; //0x0000
    int32_t current_day; //0x0034
    int32_t current_month; //0x0038
    int32_t current_year; //0x003C
    char pad_0040[32]; //0x0040
}; //Size: 0x0060

class ScriptFunctionsUnk1
{
public:
    class ScriptFunctionsUnk2* pScriptFunctionsUnk2; //0x0000
}; //Size: 0x0008

class ScriptFunctionsUnk2
{
public:
    class LuaScriptFunctions3* pLuaScriptFunctions; //0x0000
}; //Size: 0x0008

class LuaScriptFunctions3
{
public:
    void* pThis; //0x0000
}; //Size: 0x0008



class ScriptService
{
public:
    char pad_0000[8]; //0x0000
    void* Lua_State; //0x0008
    void* mLuaCallHistory; //0x0010
    char pad_0018[40]; //0x0018
    void* MaybeLuaFunctions; //0x0040
    int32_t CompiledLuaCount; //0x0048
    char pad_004C[4]; //0x004C
    void* CompiledLua1; //0x0050
    void* N00000BCC; //0x0058
    int32_t MaybeCompiledLua1Size; //0x0060
    char pad_0064[4]; //0x0064
    void* CompiledLua2; //0x0068
    void* N00000BCF; //0x0070
    int32_t MaybeCompiledLua2Size; //0x0078
    char pad_007C[12]; //0x007C
}; //Size: 0x0088


class g_Databases
{
public:
    class DBinDBContainer* pDBinDBContainer; //0x0000

}; //Size: 0x0008

class DBinDBContainer
{
public:
    char pad_0000[16]; //0x0000
    class DBinDB* pDBinDB; //0x0010
}; //Size: 0x0018

class DBPath
{
public:
    class DBDescInst* pThis; //0x0008
    char txtPath[32]; //0x0010
    char pad_0030[32]; //0x0030

    virtual void Function0();
    virtual void Function1();
    virtual void Function2();
}; //Size: 0x0050

class DBDescInst
{
public:
    class DBPath* N000023E5; //0x0000
    char pad_0008[4]; //0x0008
    char shortname[4]; //0x000C
    char pad_0010[8]; //0x0010
    char writeshortname[4]; //0x0018
    char pad_001C[108]; //0x001C
}; //Size: 0x0088

class DB_FIELD
{
public:
    int32_t fieldtype; //0x0000
    int32_t bitoffset; //0x0004
    char fieldshortname[4]; //0x0008
    int32_t depth; //0x000C
}; //Size: 0x0010

class DB_TABLE
{
public:
    char pad_0000[8]; //0x0000
    class DB_TABLE* nestedTable; //0x0008
    char pad_0010[32]; //0x0010
    void* firstRecord; //0x0030
    char pad_0038[8]; //0x0038
    char shortname[4]; //0x0040
    int32_t record_size; //0x0044
    int32_t bit_records_count; //0x0048
    int32_t unknown0; //0x004C
    int32_t compressed_str_len; //0x0050
    char pad_0054[36]; //0x0054
    int16_t total_records; //0x0078
    int16_t total_records2; //0x007A
    int16_t written_records; //0x007C
    int16_t canceled_records; //0x007E
    int16_t Unk16; //0x0080
    int8_t fieldcount; //0x0082
    int8_t unk; //0x0083
    class DB_FIELD arrFields[999]; //0x0084
}; //Size: 0x0964

class clsToNames
{
public:
    char pad_0000[680]; //0x0000
    class DBTableCls* pBGwe; //0x02A8
    char pad_02B0[1624]; //0x02B0
}; //Size: 0x0908

class DBTableCls
{
public:
    char pad_0008[32]; //0x0008
    class DB_TABLE* instDBTable; //0x0028
    class clsToNames* toNames; //0x0030
    char pad_0030[56]; //0x0030

    virtual void Function0();
    virtual void Function1();
    virtual void Function2();
    virtual void Function3();
    virtual void Function4();
    virtual void Function5();
    virtual void Function6();
    virtual void Function7();
    virtual void Function8();
    virtual void Function9();
}; //Size: 0x0068

class DBTableClsWraper
{
public:
    class DBTableCls* pDBTableCLs; //0x0000
}; //Size: 0x0008

class DBTableArr
{
public:
    class DBTableClsWraper instDBTableCls[99]; //0x0000
}; //Size: 0x0178

class DBObj
{
public:
    char vTable[8]; //0x0000
    class DBDescInst* pDBDesc; //0x0008
    char pad_0010[4]; //0x0010
    int32_t NumOfTablesInDB; //0x0014
    char pad_0018[8]; //0x0018
    class DBTableArr* pDBTables; //0x0020
    char pad_0028[8]; //0x0028

    //virtual void Function0();
    //virtual void Function1();
    //virtual void Function2();
    //virtual void Function3();
    //virtual void Function4();
    //virtual void Function5();
    //virtual void Function6();
    //virtual void Function7();
    //virtual void Function8();
    //virtual void Function9();
}; //Size: 0x0030

class DBinDB
{
public:
    char pad_0000[4]; //0x0000
    char shortname_loc[4]; //0x0004
    char pad_0008[864]; //0x0008
    int32_t NumOfDBinDB; //0x0368
    char pad_036C[4]; //0x036C
    class DBObj DBinDBArr[99]; //0x0370
}; //Size: 0x0D10

class PlayerName
{
public:
    int32_t playerid; //0x0000
    char pad_0004[772]; //0x0004
    char Name[8]; //0x0308
    char pad_0310[216]; //0x0310
}; //Size: 0x03E8

class FileInfo
{
public:
    unsigned int unk1;
    unsigned int unk2;
    unsigned int unk3;
    unsigned int unk4;
    char _0x0028[0x18];
    __int64 fileSize;
};

// https://www.unknowncheats.me/forum/frostbite/162503-buildinfo.html
class BuildInfo
{
public:
    virtual const char* getBranchName();
    virtual const char* getLicenseeId();
    virtual const char* getEngine();
    virtual __int64            getChangelistOne();
    virtual __int64            getChangelistTwo();
    virtual __int64            getFrostbiteChangelist();
    virtual const char* getUsername();
    virtual bool getBool();
    virtual const char* getUsergroup();
    virtual const char* getBuildTime();
    virtual const char* getBuildDate();
    virtual const char* getBuildDateTime();
    virtual const char* getBuildDateTimee();
    virtual const char* getBuildDateTimeee();
    virtual __int64 getUnk();   // nullptr

    static BuildInfo* GetInstance()
